In [4]:
import pandas as pd
import numpy as np
import scipy.stats as stats
#import glob

In [42]:
path = './data/'
documents = ['diversity_school', 'salary_potential', 'tuition_income',
'historical_tuition', 'tuition_cost', 'table']
datasets = {}

for doc in documents:
    filename = path + doc + '.csv'
    df = pd.read_csv(filename, sep=',', header=0)
    datasets[doc] = df

diversity_school
                            name  total_enrollment    state  \
0  University of Phoenix-Arizona            195059  Arizona
1  University of Phoenix-Arizona            195059  Arizona
2  University of Phoenix-Arizona            195059  Arizona

                          category  enrollment
0                            Women      134722
1  American Indian / Alaska Native         876
2                            Asian        1959



salary_potential
   rank                                 name state_name  early_career_pay  \
0     1                    Auburn University    Alabama             54400
1     2  University of Alabama in Huntsville    Alabama             57500
2     3            The University of Alabama    Alabama             52300

   mid_career_pay  make_world_better_percent  stem_percent
0          104500                       51.0            31
1          103900                       59.0            45
2           97400                       50.0            15



tuition_income
                                name state  total_price  year     campus  \
0  Piedmont International University    NC        20174  2016  On Campus
1  Piedmont International University    NC        20174  2016  On Campus
2  Piedmont International University    NC        20174  2016  On Campus

   net_cost        income_lvl
0   11475.0       0 to 30,000
1   11451.0  30,001 to 48,000
2   16229.0  48_001 to 75,000



historical_tuition
               type     year     tuition_type  tuition_cost
0  All Institutions  1985-86     All Constant         10893
1  All Institutions  1985-86  4 Year Constant         12274
2  All Institutions  1985-86  2 Year Constant          7508



tuition_cost
                                   name    state state_code     type  \
0                Aaniiih Nakoda College  Montana         MT   Public
1          Abilene Christian University    Texas         TX  Private
2  Abraham Baldwin Agricultural College  Georgia         GA   Public

  degree_length  room_and_board  in_state_tuition  in_state_total  \
0        2 Year             NaN              2380            2380
1        4 Year         10350.0             34850           45200
2        2 Year          8474.0              4128           12602

   out_of_state_tuition  out_of_state_total
0                  2380                2380
1                 34850               45200
2                 12550               21024

In [10]:
datasets['tuition_income']['year'].unique()

array([2016, 2017, 2018, 2015, 2014, 2013, 2012, 2011, 2010], dtype=int64)

In [16]:
datasets['historical_tuition'].head(10)

               type     year     tuition_type  tuition_cost
0  All Institutions  1985-86     All Constant         10893
1  All Institutions  1985-86  4 Year Constant         12274
2  All Institutions  1985-86  2 Year Constant          7508
3  All Institutions  1985-86      All Current          4885
4  All Institutions  1985-86   4 Year Current          5504
5  All Institutions  1985-86   2 Year Current          3367
6  All Institutions  1995-96     All Constant         13822
7  All Institutions  1995-96  4 Year Constant         16224
8  All Institutions  1995-96  2 Year Constant          7421
9  All Institutions  1995-96      All Current          8800

In [43]:
datasets['table']['Year'].unique()

array(['1985�862', '1995�96', '2000�01', '2001�02', '2002�03', '2003�04',
       '2004�05', '2005�06', '2006�07', '2007�08', '2008�09', '2009�10',
       '2010�11', '2011�12', '2012�13', '2013�14', '2014�15', '2015�16',
       '2016�17', '2017�18', '2018�19'], dtype=object)

In [35]:
datasets['table'].loc[datasets['table']['Year'] == '1985–862', 'Year'] = '1985-1986'

Series([], Name: Year, dtype: object)

In [37]:
datasets['table']

,Category,Year,Constant_All,Constant_4-Year,Constant_2-year,Contemporary_All,Contemporary_4-Year,Contemporary_2-Year
0,all,1985-1986,11369,12811,7836,4885,5504,3367
1,all,1995–96,14426,16934,7745,8800,10330,4725
2,all,2000–01,15651,18692,7907,10820,12922,5466
3,all,2001–02,16175,19386,8127,11380,13639,5718
4,all,2002–03,16708,20081,8695,12014,14439,6252
...,...,...,...,...,...,...,...,...
57,pri,2014–15,40045,40651,26032,37422,37988,24327
58,pri,2015–16,41472,42021,25909,39016,39534,24375
59,pri,2016–17,42712,43279,25976,40922,41465,24888
60,pri,2017–18,43557,44025,26126,42673,43131,25596
61,pri,2018–19,44306,44662,28627,44306,44662,28627

In [41]:
datasets['historical_tuition']#[datasets['historical_tuition']['type'] == 'All Institutions']

                 type     year     tuition_type  tuition_cost
0    All Institutions  1985-86     All Constant         10893
1    All Institutions  1985-86  4 Year Constant         12274
2    All Institutions  1985-86  2 Year Constant          7508
3    All Institutions  1985-86      All Current          4885
4    All Institutions  1985-86   4 Year Current          5504
..                ...      ...              ...           ...
265           Private  2016-17  4 Year Constant         41468
266           Private  2016-17  2 Year Constant         24882
267           Private  2016-17      All Current         40925
268           Private  2016-17   4 Year Current         41468
269           Private  2016-17   2 Year Current         24882

[270 rows x 4 columns]